<a href="https://colab.research.google.com/github/yeb2Binfang/sklearn_learning/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Titanic - Machine Learning from Disaster
泰坦尼克号的沉没是世界上最严重的海难事故之一，今天我们通过分类树模型来预测一下哪些人可能成为幸存者。数据集来自https://www.kaggle.com/c/titanic
数据集包含两个csv格式文件，data为我们接下来要使用的数据，test为kaggle提供的测试集。
我已经把data uploaded到github了，可以直接用

data:https://raw.githubusercontent.com/yeb2Binfang/sklearn_learning/main/decision_tree/Titanic_data.csv

test: https://raw.githubusercontent.com/yeb2Binfang/sklearn_learning/main/decision_tree/Titanic_test.csv

import some necessary packages

In [1]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import cross_val_score
import matplotlib.pyplot as plt

##get the data

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/yeb2Binfang/sklearn_learning/main/decision_tree/Titanic_data.csv")
df[0:5]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

我们要去查看数据，看看有没有缺失的啊，看看有没有哪些features是没用的啊之类的

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##数据预处理
删除不需要的，删除一些缺失值很多的，补缺失值

In [6]:
#删除缺失值过多的，删除不需要的features
df.drop(["Cabin","Name","Ticket"], inplace=True, axis=1)

In [9]:
df.drop(["PassengerId"], inplace=True,axis = 1)

In [10]:
df[0:5]

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [11]:
#处理缺失值，对缺失值较多的列进行填补，对年龄来说，缺失值可以用平均值
#可以去了解一下怎么去不缺失值
df["Age"] = df["Age"].fillna(df["Age"].mean())

#我们注意到，Embarked那里，缺失了两个数值，影响不大，可以删掉
df = df.dropna()